blog/2015-12-31-trine-utility-library.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://neiro.io/rss.xml"
      title="RSS feed for https://neiro.io/"/>
<title>Trine util library</title>
<meta name="author" content="Aleksei Kuznetsov">
    <meta name="referrer" content="no-referrer">
    <link href= "https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css" rel="stylesheet" type="text/css" />
    <link href= "static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status">
<div class="header">
    <a href="https://neiro.io">Neiro - Functional programming, software architecture</a>
  </div></div>
<div id="content">
<div class="post-date">31 Dec 2015</div><h1 class="post-title"><a href="https://neiro.io/2015-12-31-trine-utility-library.html">Trine util library</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#installing">1. Installing</a></li>
<li><a href="#boolean">2. Boolean</a></li>
<li><a href="#number">3. Number</a></li>
<li><a href="#value">4. Value</a></li>
<li><a href="#partial">5. Partial</a></li>
<li><a href="#object">6. Object</a></li>
<li><a href="#iterable">7. Iterable</a></li>
<li><a href="#conclusion">8. Conclusion</a></li>
</ul>
</div>
</nav>
<p>
As we know, functional programming in JavaScript is not the best
experience, unlike the plain functional languages (<i>Haskell, Lisp,
etc</i>). But new standards of JavaScript - ES6 <i>(ECMAScript 2015)</i> and
<i>ES7(ECMAScript 2016)</i> introduce some improvements and allows you to
write code in more functional style:
</p>

<div class="org-src-container">
<pre class="src src-javascript"> flatten(collection.filter(func1).map(func2));

</pre>
</div>

<p>
But there&rsquo;s more: new
<a href="https://github.com/zenparsing/es-function-bind">function bind syntax</a>
performs function binding and method extraction. The previous example
can be rewritten as:
</p>

<div class="org-src-container">
<pre class="src src-javascript">
collection.filter(func1).map(func2)::flatten();
</pre>
</div>

<p>
ES6 also introduces the concept of iterators - protocol, that most JS
collection types implement. You can extend your custom collections to
support the same protocol, and generators functions support it too. So,
if you looking for utility library that supports new function bind
syntax, and iterators, you can take a look on
<a href="https://github.com/jussi-kalliokoski/trine">Trine</a>.
</p>

<div id="outline-container-installing" class="outline-2">
<h2 id="installing"><span class="section-number-2">1</span> Installing</h2>
<div class="outline-text-2" id="text-installing">
<p>
First of all, you may want to use all features of ES6 and most of ES7
standards with <a href="https://babeljs.io/">Babel</a>:
</p>

<p>
<i>npm install &#x2013;save babel babel-preset-stage-0 babel-preset-es2015</i>
</p>
<div class="org-src-container">
<pre class="src src-javascript"> <span style="color: #5a5b5a;">//</span><span style="color: #5a5b5a;">.babelrc { "presets": ["stage-0", "es2015"]</span>
}
</pre>
</div>

<p>
Then install Trine:
</p>

<p>
<i>npm install &#x2013;save trine</i>
</p>

<p>
and import to your project required functions:
</p>

<div class="org-src-container">
<pre class="src src-javascript"> <span style="color: #b294bb;">import</span> { last } from <span style="color: #b5bd68;">'trine/iterable/last'</span>;

 <span style="color: #b294bb;">const</span> <span style="color: #cc6666;">lastCh</span> = [<span style="color: #b5bd68;">'a'</span>, <span style="color: #b5bd68;">'b'</span>, <span style="color: #b5bd68;">'c'</span>]::last(<span style="color: #de935f; font-weight: bold;">0</span>); <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">yields 'c'</span>
 lastCh.next().value; <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">c</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-boolean" class="outline-2">
<h2 id="boolean"><span class="section-number-2">2</span> Boolean</h2>
<div class="outline-text-2" id="text-boolean">
<p>
Trine provides common boolean helpers:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #de935f;">true</span>::not() <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">false</span>
<span style="color: #de935f;">true</span>::and(<span style="color: #de935f;">false</span>) <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">false</span>
<span style="color: #de935f;">true</span>::or(<span style="color: #de935f;">false</span>) <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">true</span>
<span style="color: #de935f;">true</span>::xor(<span style="color: #de935f;">false</span>) <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">true</span>
<span style="color: #de935f; font-weight: bold;">0</span>::not() <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-number" class="outline-2">
<h2 id="number"><span class="section-number-2">3</span> Number</h2>
<div class="outline-text-2" id="text-number">
<p>
#+begin<sub>src</sub> javascript
10::min(100) <i>/ 10
-100::abs() /</i> 100
4::div(2) <i>/ 2
4::mod(3) /</i> 1
2::pow(4)::max(15) // 16
</p>
</div>
</div>

<div id="outline-container-value" class="outline-2">
<h2 id="value"><span class="section-number-2">4</span> Value</h2>
<div class="outline-text-2" id="text-value">
<p>
Extract , compare or convert values to functions:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">'foo'</span>::equals(<span style="color: #b5bd68;">'bar'</span>)::is(<span style="color: #de935f;">false</span>); <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">true</span>
<span style="color: #b294bb;">const</span> <span style="color: #cc6666;">func</span> = { foo: <span style="color: #b5bd68;">'bar'</span> }::prop(<span style="color: #b5bd68;">'foo'</span>)::toFunction();
func(); <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">bar</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-partial" class="outline-2">
<h2 id="partial"><span class="section-number-2">5</span> Partial</h2>
<div class="outline-text-2" id="text-partial">
<p>
Trine includes partial helper:
</p>

<div class="org-src-container">
<pre class="src src-javascript">parseInt::partial(_, <span style="color: #de935f; font-weight: bold;">2</span>)(<span style="color: #b5bd68;">'1010'</span>) <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">10</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-object" class="outline-2">
<h2 id="object"><span class="section-number-2">6</span> Object</h2>
<div class="outline-text-2" id="text-object">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b294bb;">let</span> <span style="color: #cc6666;">obj</span> = { foo: <span style="color: #b5bd68;">'bar'</span> };
obj::keys().next().value; <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">foo</span>
obj::values().next().value; <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">bar</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-iterable" class="outline-2">
<h2 id="iterable"><span class="section-number-2">7</span> Iterable</h2>
<div class="outline-text-2" id="text-iterable">
<div class="org-src-container">
<pre class="src src-javascript"> <span style="color: #b294bb;">let</span> <span style="color: #cc6666;">nums</span> = [<span style="color: #de935f; font-weight: bold;">5</span>, <span style="color: #de935f; font-weight: bold;">1</span>];
nums::count().next().value; <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">2</span>
nums::reverse()::to(Array); <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">1, 5</span>
<span style="color: #b5bd68;">'cab'</span>::sortAlphabetically()::to(Array) <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">a, b, c</span>
[nums, [<span style="color: #de935f; font-weight: bold;">2</span>, <span style="color: #de935f; font-weight: bold;">3</span>]]::flatten()::map(<span style="color: #b294bb;">function</span>() { <span style="color: #b294bb;">return</span> <span style="color: #de935f;">this</span> * <span style="color: #de935f; font-weight: bold;">3</span> })::to(Array); <span style="color: #5a5b5a;">// </span><span style="color: #5a5b5a;">15, 3, 6, 9</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion"><span class="section-number-2">8</span> Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
If you like new syntax of ES6, ES7 and want to use iterators, function
binding, you can use Trine as base utility library. If you want to know
more about Trine, you can take a look at it&rsquo;s
<a href="http://jussi-kalliokoski.github.io/trine/docs/latest/">documentation</a>
.
</p>
</div>
</div>
<div class="taglist"><a href="https://neiro.io/tags.html">Tags</a>: <a href="https://neiro.io/tag-javascript.html">javascript</a> <a href="https://neiro.io/tag-functional.html">functional</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
